Revit 2026 API

# StairsTextOrientation Enumeration

---

The options to be used when orienting text annotations relative to stairs.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsTextOrientation
```
```vb
Public Enumeration StairsTextOrientation
```
```cpp
public enum class StairsTextOrientation
```
```fsharp
type StairsTextOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| Horizontal | 0 | Indicator text will be displayed horizontally. |
| Vertical | 1 | Indicator text will be displayed vertically. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace